###############################################################################
# Created by write_sdc
# Tue Dec 27 05:00:34 2022
###############################################################################
current_design triple_ported_memory
###############################################################################
# Timing Constraints
###############################################################################
if {[info exists ::env(CLOCK_PORT)] && $::env(CLOCK_PORT) != ""} {
    create_clock [get_ports $::env(CLOCK_PORT)]  -name $::env(CLOCK_PORT)  -period $::env(CLOCK_PERIOD)
} else {
    create_clock -name __VIRTUAL_CLK__ -period $::env(CLOCK_PERIOD)
    set ::env(CLOCK_PORT) __VIRTUAL_CLK__
}
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_addr[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_in[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_valid_in}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_wen}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_addr[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_in[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_valid_in}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_wen}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_addr[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_in[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_valid_in}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_wen}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {freeze_inputs}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_data_out[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port1_valid_out}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_data_out[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port2_valid_out}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_data_out[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {port3_valid_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {freeze_inputs}]
set_load -pin_load 0.0334 [get_ports {port1_valid_out}]
set_load -pin_load 0.0334 [get_ports {port2_valid_out}]
set_load -pin_load 0.0334 [get_ports {port3_valid_out}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[15]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[14]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[13]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[12]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[11]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[10]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[9]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[8]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[7]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[6]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[5]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[4]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[3]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[2]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[1]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[0]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[15]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[14]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[13]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[12]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[11]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[10]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[9]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[8]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[7]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[6]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[5]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[4]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[3]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[2]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[1]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[0]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[15]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[14]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[13]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[12]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[11]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[10]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[9]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[8]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[7]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[6]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[5]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[4]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[3]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[2]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[1]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_valid_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_valid_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_valid_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 100.0000 [current_design]
