###############################################################################
# Created by write_sdc
# Mon Dec 26 05:10:49 2022
###############################################################################
current_design memory_bank_logic
###############################################################################
# Timing Constraints
###############################################################################
if {[info exists ::env(CLOCK_PORT)] && $::env(CLOCK_PORT) != ""} {
    create_clock [get_ports $::env(CLOCK_PORT)]  -name $::env(CLOCK_PORT)  -period $::env(CLOCK_PERIOD)
} else {
    create_clock -name __VIRTUAL_CLK__ -period $::env(CLOCK_PERIOD)
    set ::env(CLOCK_PORT) __VIRTUAL_CLK__
}
set_clock_transition $::env(SYNTH_CLOCK_TRANSITION) [get_clocks $::env(CLOCK_PORT)]
set_clock_uncertainty $::env(SYNTH_CLOCK_UNCERTAINTY) [get_clocks $::env(CLOCK_PORT)]
set_propagated_clock [get_clocks {clk}]
set_input_transition 2.0000 [get_ports {BANK_ID[0]}]
set_input_transition 2.0000 [get_ports {BANK_ID[1]}]
set_input_transition 2.0000 [get_ports {port1_addr[0]}]
set_input_transition 2.0000 [get_ports {port1_addr[10]}]
set_input_transition 2.0000 [get_ports {port1_addr[11]}]
set_input_transition 2.0000 [get_ports {port1_addr[1]}]
set_input_transition 2.0000 [get_ports {port1_addr[2]}]
set_input_transition 2.0000 [get_ports {port1_addr[3]}]
set_input_transition 2.0000 [get_ports {port1_addr[4]}]
set_input_transition 2.0000 [get_ports {port1_addr[5]}]
set_input_transition 2.0000 [get_ports {port1_addr[6]}]
set_input_transition 2.0000 [get_ports {port1_addr[7]}]
set_input_transition 2.0000 [get_ports {port1_addr[8]}]
set_input_transition 2.0000 [get_ports {port1_addr[9]}]
set_input_transition 2.0000 [get_ports {port1_data_in[0]}]
set_input_transition 2.0000 [get_ports {port1_data_in[10]}]
set_input_transition 2.0000 [get_ports {port1_data_in[11]}]
set_input_transition 2.0000 [get_ports {port1_data_in[12]}]
set_input_transition 2.0000 [get_ports {port1_data_in[13]}]
set_input_transition 2.0000 [get_ports {port1_data_in[14]}]
set_input_transition 2.0000 [get_ports {port1_data_in[15]}]
set_input_transition 2.0000 [get_ports {port1_data_in[1]}]
set_input_transition 2.0000 [get_ports {port1_data_in[2]}]
set_input_transition 2.0000 [get_ports {port1_data_in[3]}]
set_input_transition 2.0000 [get_ports {port1_data_in[4]}]
set_input_transition 2.0000 [get_ports {port1_data_in[5]}]
set_input_transition 2.0000 [get_ports {port1_data_in[6]}]
set_input_transition 2.0000 [get_ports {port1_data_in[7]}]
set_input_transition 2.0000 [get_ports {port1_data_in[8]}]
set_input_transition 2.0000 [get_ports {port1_data_in[9]}]
set_input_transition 2.0000 [get_ports {port1_req_tag_in[0]}]
set_input_transition 2.0000 [get_ports {port1_req_tag_in[1]}]
set_input_transition 2.0000 [get_ports {port1_valid}]
set_input_transition 2.0000 [get_ports {port1_wen}]
set_input_transition 2.0000 [get_ports {port2_addr[0]}]
set_input_transition 2.0000 [get_ports {port2_addr[10]}]
set_input_transition 2.0000 [get_ports {port2_addr[11]}]
set_input_transition 2.0000 [get_ports {port2_addr[1]}]
set_input_transition 2.0000 [get_ports {port2_addr[2]}]
set_input_transition 2.0000 [get_ports {port2_addr[3]}]
set_input_transition 2.0000 [get_ports {port2_addr[4]}]
set_input_transition 2.0000 [get_ports {port2_addr[5]}]
set_input_transition 2.0000 [get_ports {port2_addr[6]}]
set_input_transition 2.0000 [get_ports {port2_addr[7]}]
set_input_transition 2.0000 [get_ports {port2_addr[8]}]
set_input_transition 2.0000 [get_ports {port2_addr[9]}]
set_input_transition 2.0000 [get_ports {port2_data_in[0]}]
set_input_transition 2.0000 [get_ports {port2_data_in[10]}]
set_input_transition 2.0000 [get_ports {port2_data_in[11]}]
set_input_transition 2.0000 [get_ports {port2_data_in[12]}]
set_input_transition 2.0000 [get_ports {port2_data_in[13]}]
set_input_transition 2.0000 [get_ports {port2_data_in[14]}]
set_input_transition 2.0000 [get_ports {port2_data_in[15]}]
set_input_transition 2.0000 [get_ports {port2_data_in[1]}]
set_input_transition 2.0000 [get_ports {port2_data_in[2]}]
set_input_transition 2.0000 [get_ports {port2_data_in[3]}]
set_input_transition 2.0000 [get_ports {port2_data_in[4]}]
set_input_transition 2.0000 [get_ports {port2_data_in[5]}]
set_input_transition 2.0000 [get_ports {port2_data_in[6]}]
set_input_transition 2.0000 [get_ports {port2_data_in[7]}]
set_input_transition 2.0000 [get_ports {port2_data_in[8]}]
set_input_transition 2.0000 [get_ports {port2_data_in[9]}]
set_input_transition 2.0000 [get_ports {port2_req_tag_in[0]}]
set_input_transition 2.0000 [get_ports {port2_req_tag_in[1]}]
set_input_transition 2.0000 [get_ports {port2_valid}]
set_input_transition 2.0000 [get_ports {port2_wen}]
set_input_transition 2.0000 [get_ports {port3_addr[0]}]
set_input_transition 2.0000 [get_ports {port3_addr[10]}]
set_input_transition 2.0000 [get_ports {port3_addr[11]}]
set_input_transition 2.0000 [get_ports {port3_addr[1]}]
set_input_transition 2.0000 [get_ports {port3_addr[2]}]
set_input_transition 2.0000 [get_ports {port3_addr[3]}]
set_input_transition 2.0000 [get_ports {port3_addr[4]}]
set_input_transition 2.0000 [get_ports {port3_addr[5]}]
set_input_transition 2.0000 [get_ports {port3_addr[6]}]
set_input_transition 2.0000 [get_ports {port3_addr[7]}]
set_input_transition 2.0000 [get_ports {port3_addr[8]}]
set_input_transition 2.0000 [get_ports {port3_addr[9]}]
set_input_transition 2.0000 [get_ports {port3_data_in[0]}]
set_input_transition 2.0000 [get_ports {port3_data_in[10]}]
set_input_transition 2.0000 [get_ports {port3_data_in[11]}]
set_input_transition 2.0000 [get_ports {port3_data_in[12]}]
set_input_transition 2.0000 [get_ports {port3_data_in[13]}]
set_input_transition 2.0000 [get_ports {port3_data_in[14]}]
set_input_transition 2.0000 [get_ports {port3_data_in[15]}]
set_input_transition 2.0000 [get_ports {port3_data_in[1]}]
set_input_transition 2.0000 [get_ports {port3_data_in[2]}]
set_input_transition 2.0000 [get_ports {port3_data_in[3]}]
set_input_transition 2.0000 [get_ports {port3_data_in[4]}]
set_input_transition 2.0000 [get_ports {port3_data_in[5]}]
set_input_transition 2.0000 [get_ports {port3_data_in[6]}]
set_input_transition 2.0000 [get_ports {port3_data_in[7]}]
set_input_transition 2.0000 [get_ports {port3_data_in[8]}]
set_input_transition 2.0000 [get_ports {port3_data_in[9]}]
set_input_transition 2.0000 [get_ports {port3_req_tag_in[0]}]
set_input_transition 2.0000 [get_ports {port3_req_tag_in[1]}]
set_input_transition 2.0000 [get_ports {port3_valid}]
set_input_transition 2.0000 [get_ports {port3_wen}]
set_input_transition 2.0000 [get_ports {sram_r_dout[0]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[10]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[11]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[12]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[13]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[14]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[15]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[1]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[2]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[3]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[4]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[5]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[6]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[7]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[8]}]
set_input_transition 2.0000 [get_ports {sram_r_dout[9]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[0]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[10]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[11]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[12]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[13]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[14]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[15]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[1]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[2]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[3]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[4]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[5]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[6]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[7]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[8]}]
set_input_transition 2.0000 [get_ports {sram_rw_dout[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {port1_valid_out}]
set_load -pin_load 0.0334 [get_ports {port2_valid_out}]
set_load -pin_load 0.0334 [get_ports {port3_valid_out}]
set_load -pin_load 0.0334 [get_ports {postrs_valid}]
set_load -pin_load 0.0334 [get_ports {postrws_valid}]
set_load -pin_load 0.0334 [get_ports {postrws_w_en}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[15]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[14]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[13]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[12]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[11]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[10]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[9]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[8]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[7]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[6]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[5]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[4]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[3]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[2]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[1]}]
set_load -pin_load 0.0334 [get_ports {port1_data_out[0]}]
set_load -pin_load 0.0334 [get_ports {port1_req_tag_out[1]}]
set_load -pin_load 0.0334 [get_ports {port1_req_tag_out[0]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[15]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[14]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[13]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[12]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[11]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[10]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[9]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[8]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[7]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[6]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[5]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[4]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[3]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[2]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[1]}]
set_load -pin_load 0.0334 [get_ports {port2_data_out[0]}]
set_load -pin_load 0.0334 [get_ports {port2_req_tag_out[1]}]
set_load -pin_load 0.0334 [get_ports {port2_req_tag_out[0]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[15]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[14]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[13]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[12]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[11]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[10]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[9]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[8]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[7]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[6]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[5]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[4]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[3]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[2]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[1]}]
set_load -pin_load 0.0334 [get_ports {port3_data_out[0]}]
set_load -pin_load 0.0334 [get_ports {port3_req_tag_out[1]}]
set_load -pin_load 0.0334 [get_ports {port3_req_tag_out[0]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[9]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[8]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[7]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[6]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[5]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[4]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[3]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[2]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[1]}]
set_load -pin_load 0.0334 [get_ports {postrs_addr[0]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[9]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[8]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[7]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[6]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[5]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[4]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[3]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[2]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[1]}]
set_load -pin_load 0.0334 [get_ports {postrws_addr[0]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[15]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[14]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[13]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[12]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[11]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[10]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[9]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[8]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[7]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[6]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[5]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[4]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[3]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[2]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[1]}]
set_load -pin_load 0.0334 [get_ports {postrws_data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_wen}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BANK_ID[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {BANK_ID[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_req_tag_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port1_req_tag_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_req_tag_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port2_req_tag_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_data_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_req_tag_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {port3_req_tag_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_r_dout[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sram_rw_dout[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 100.0000 [current_design]
